app/Controllers/AgentController.php

    public function index()
    {
        // Pastikan hanya user dengan role 'agen' yang bisa mengakses
        if (session()->get('role') !== 'agen') {
            return redirect()->to(base_url('/login'))->with('error', 'Anda tidak memiliki akses ke halaman ini.');
        }

        $agenId = session()->get('id'); // Ambil ID agen yang sedang login

        // Dapatkan data agen dari tabel users
        $agenData = $this->userModel->find($agenId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '3'

        }

        // Dapatkan semua order_id yang dimiliki oleh agen ini dan ditujukan ke distributor ini
        $agenOrderIds = $this->orderModel
            ->select('id')
            ->where('agen_id', $agenId)
            ->where('distributor_id', $distributorId)
            ->findAll();
---
SELECT `id`
FROM `orders`
WHERE `agen_id` = '3'
AND `distributor_id` = '2'


        // *************** Perhitungan Order ***************
        // Hitung total order yang diajukan agen ke distributornya
        $totalOrders = $this->orderModel
            ->where('agen_id', $agenId)
            ->where('distributor_id', $distributorId)
            ->countAllResults();

        // Hitung pesanan tertunda (status 'pending')
        $pendingOrders = $this->orderModel
            ->where('agen_id', $agenId)
            ->where('distributor_id', $distributorId)
            ->whereIn('status', ['pending', 'approved'])
            ->countAllResults();

        // Hitung pesanan diproses/dikirim (status 'processing' atau 'shipped')
        $shippedOrders = $this->orderModel
            ->where('agen_id', $agenId)
            ->where('distributor_id', $distributorId)
            ->whereIn('status', ['processing', 'shipped'])
            ->countAllResults();

        // Hitung pesanan selesai (status 'completed')
        $completedOrders = $this->orderModel
            ->where('agen_id', $agenId)
            ->where('distributor_id', $distributorId)
            ->where('status', 'completed')
            ->countAllResults();

        // Hitung pesanan ditolak (status 'rejected') - TAMBAH INI
        $rejectedOrders = $this->orderModel
            ->where('agen_id', $agenId)
            ->where('distributor_id', $distributorId)
            ->where('status', 'rejected')
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `agen_id` = '3'
AND `distributor_id` = '2'
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `agen_id` = '3'
AND `distributor_id` = '2'
AND `status` IN ('pending','approved')
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `agen_id` = '3'
AND `distributor_id` = '2'
AND `status` IN ('processing','shipped')
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `agen_id` = '3'
AND `distributor_id` = '2'
AND `status` = 'completed'
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `agen_id` = '3'
AND `distributor_id` = '2'
AND `status` = 'rejected'



        // Ambil order terbaru atau order yang masih aktif (misal 5 terbaru)
        $recentOrders = $this->orderModel
            ->where('agen_id', $agenId)
            ->where('distributor_id', $distributorId)
            ->orderBy('order_date', 'DESC')
            ->limit(5)
            ->findAll();

        // Untuk menampilkan nama distributor di dashboard agen
        $distributorName = 'Tidak Diketahui';
        $distributor = $this->userModel->find($distributorId);
---
SELECT *
FROM `orders`
WHERE `agen_id` = '3'
AND `distributor_id` = '2'
ORDER BY `order_date` DESC
 LIMIT 5
SELECT *
FROM `users`
WHERE `users`.`id` = '2'