app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `username` = 'pabrik_admin'
 LIMIT 1
---
    public function processLogin()
    {
        $rules = [
            'username' => 'required|min_length[3]|max_length[155]|alpha_dash',
            'password' => 'required',
        ];

        $messages = [
            'username' => [
                'required'   => 'Username harus diisi.',
                'min_length' => 'Username minimal 3 karakter.',
                'max_length' => 'Username maksimal 155 karakter.',
                'alpha_dash' => 'Username hanya boleh berisi huruf, angka, dash (-), atau underscore (_).'
            ],
            'password' => [
                'required' => 'Password harus diisi.',
            ],
        ];

        if (! $this->validate($rules, $messages)) {
            return redirect()->back()->withInput()->with('validation', $this->validator);
        }

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');
        $rememberMe = $this->request->getPost('remember_me');

        $user = $this->userModel->where('username', $username)->first();

UPDATE `users` SET `remember_selector` = NULL, `remember_token` = NULL, `updated_at` = '2025-09-01 03:30:53'
WHERE `users`.`id` IN ('3')
---
    public function logout()
    {
        // 1. Dapatkan ID pengguna dari session yang sedang aktif
        $userId = session()->get('id');

        // 2. Jika ada pengguna yang login (berdasarkan session), hapus tokennya di database
        if ($userId) {
            $this->userModel->update($userId, [
                'remember_selector' => null,
                'remember_token'    => null
            ]);