app/Controllers/PabrikOrderController.php

SELECT *
FROM `users`
WHERE `id` IN (2,4)
---

        // Fetch usernames for unique distributor IDs
        if (!empty($uniqueDistributorIds)) {
            $distributors = $this->userModel->whereIn('id', array_keys($uniqueDistributorIds))->findAll();

SELECT *
FROM `users`
WHERE `id` IN (14,5)
---

        // Fetch usernames for unique agen IDs
        if (!empty($uniqueAgenIds)) {
            $agens = $this->userModel->whereIn('id', array_keys($uniqueAgenIds))->findAll();