app/Controllers/PabrikShipmentController.php

SELECT *
FROM `orders`
WHERE `id` IN ('34','32','31','29','28','27','19','17','14','18')
SELECT *
FROM `users`
WHERE `id` IN ('2','24','14')
---
    private function _getRelatedShipmentData(array $shipments): array
    {
        if (empty($shipments)) {
            return ['ordersData' => [], 'usernamesById' => []];
        }

        $ordersData = [];
        $usernamesById = [];

        $orderIds = array_column($shipments, 'order_id');
        $orders = $this->orderModel->whereIn('id', $orderIds)->findAll();

        $userIds = [];
        foreach ($orders as $order) {
            $ordersData[$order['id']] = $order;
            if (!empty($order['distributor_id'])) $userIds[] = $order['distributor_id'];
            if (!empty($order['agen_id'])) $userIds[] = $order['agen_id'];
        }

        if (!empty($userIds)) {
            $users = $this->userModel->whereIn('id', array_unique($userIds))->findAll();