app/Controllers/PabrikController.php

    public function index()
    {
        // Pastikan hanya pabrik yang bisa mengakses
        if (session()->get('role') !== 'pabrik') {
            return redirect()->back()->with('error', 'Anda tidak diberikan akses untuk masuk ke halaman tersebut.');
        }

        // --- Data untuk Summary Cards ---
        $currentMonth = date('Y-m');
        $currentMonthStart = date('Y-m-01 00:00:00'); // Awal bulan ini
        $nextMonthStart = date('Y-m-01 00:00:00', strtotime('+1 month')); // Awal bulan depan
        $currentMonthEnd = date('Y-m-t 23:59:59'); // Akhir bulan ini (tanggal terakhir bulan)


        // 1. Order Masuk (Pending)
        $orderMasuk = $this->orderModel->where('status', 'approved')->countAllResults();

        // 2. Order Di Proses (Processing)
        $orderDiproses = $this->orderModel->where('status', 'processing')->countAllResults();

        // 3. Order Di Kirim (Shipped)
        $orderDikirim = $this->orderModel->where('status', 'shipped')->countAllResults();

        // 4. Order Selesai Bulan Ini
        $orderSelesaiBulanIni = $this->orderModel
            ->where('status', 'completed')
            ->where('DATE_FORMAT(delivery_date, "%Y-%m") =', $currentMonth)
            ->countAllResults();

        // 5. Order Gagal Bulan Ini
        $orderGagalBulanIni = $this->orderModel
            ->where('status', 'rejected')
            ->where('DATE_FORMAT(updated_at, "%Y-%m") =', $currentMonth)
            ->countAllResults();

        // 6. Tagihan Distributor Belum Lunas
        $tagihanBelumLunasResult = $this->distributorInvoiceModel
            ->selectSum('total_amount', 'total_unpaid')
            ->whereIn('status', ['unpaid', 'partially_paid'])
            ->first();
        $tagihanBelumLunas = $tagihanBelumLunasResult['total_unpaid'] ?? 0;

        // 7. Pendapatan Bulan Ini (Dari tagihan distributor yang lunas)
        $pendapatanBulanIniResult = $this->distributorInvoiceModel
            ->selectSum('total_amount', 'total_paid_month')
            ->where('status', 'paid')
            ->where('DATE_FORMAT(invoice_date, "%Y-%m") =', $currentMonth)
            ->first();
---
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `status` = 'approved'
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `status` = 'processing'
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `status` = 'shipped'
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `status` = 'completed'
AND DATE_FORMAT(delivery_date, "%Y-%m") = '2025-09'
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `status` = 'rejected'
AND DATE_FORMAT(updated_at, "%Y-%m") = '2025-09'
SELECT SUM(`total_amount`) AS `total_unpaid`
FROM `distributor_invoices`
WHERE `status` IN ('unpaid','partially_paid')
 LIMIT 1
SELECT SUM(`total_amount`) AS `total_paid_month`
FROM `distributor_invoices`
WHERE `status` = 'paid'
AND DATE_FORMAT(invoice_date, "%Y-%m") = '2025-09'
 LIMIT 1

        $totalDistributors = $this->userModel->countUsersByRole('distributor');

        // --- Data untuk Tabel Distributor Aktif Terbaru (6) ---
        $distributorAktifTerbaru = $this->userModel
            ->where('role', 'distributor')
            ->orderBy('created_at', 'DESC')
            ->limit(6)
            ->findAll();

        // --- Data untuk Grafik Pendapatan Harian (30 Hari Terakhir) ---
        $dailySalesData = $this->distributorInvoiceModel
            ->where('payment_date >=', date('Y-m-d', strtotime('-30 days')))
            ->where('status', 'paid')
            ->select("DATE(payment_date) as sales_day, SUM(total_amount) as total_revenue")
            ->groupBy('sales_day')
            ->orderBy('sales_day', 'ASC')
            ->findAll();
---
SELECT *
FROM `users`
WHERE `role` = 'distributor'
ORDER BY `created_at` DESC
 LIMIT 6
SELECT DATE(payment_date) as sales_day, SUM(total_amount) as total_revenue
FROM `distributor_invoices`
WHERE `payment_date` >= '2025-08-02'
AND `status` = 'paid'
GROUP BY `sales_day`
ORDER BY `sales_day` ASC


        // --- Data untuk Grafik Produk Terlaris (Doughnut Chart) ---
        // Mengambil data dari model order_items
        $topProductsData = $this->orderItemModel
            ->select('order_items.product_name, SUM(order_items.quantity) as total_sold')
            ->join('orders', 'orders.id = order_items.order_id')
            ->where('orders.status', 'completed') // Hanya dari order yang sudah selesai
            ->groupBy('order_items.product_name')
            ->orderBy('total_sold', 'DESC')
            ->limit(5) // Mengambil 5 produk teratas
            ->findAll();
---
SELECT `order_items`.`product_name`, SUM(order_items.quantity) as total_sold
FROM `order_items`
JOIN `orders` ON `orders`.`id` = `order_items`.`order_id`
WHERE `orders`.`status` = 'completed'
GROUP BY `order_items`.`product_name`
ORDER BY `total_sold` DESC
 LIMIT 5

        }

        // --- Data Grafik Status Order Bulan Ini (Pie Chart) ---
        $orderStatusThisMonth = $this->orderModel
            ->select('status, COUNT(id) as count')
            ->where('created_at >=', $currentMonthStart)
            ->where('created_at <=', $currentMonthEnd)
            ->groupBy('status')
            ->findAll();
---
SELECT `status`, COUNT(id) as count
FROM `orders`
WHERE `created_at` >= '2025-09-01 00:00:00'
AND `created_at` <= '2025-09-30 23:59:59'
GROUP BY `status`

    public function daftarHarga()
    {
        if (session()->get('role') !== 'pabrik') {
            return redirect()->to(base_url('/pabrik'))->with('error', 'Anda tidak memiliki akses ke halaman ini.');
        }

        $selectedDistributorId = $this->request->getVar('distributor_id'); // Ambil filter distributor_id dari URL
        $search = $this->request->getVar('search'); // Ambil parameter pencarian produk
        $perPage = 10; // Jumlah produk per halaman, Anda bisa menyesuaikannya

        // Ambil ID pabrik yang sedang login
        $pabrikId = session()->get('id');

        // Query dasar untuk produk dari pabrik yang login
        $productQuery = $this->productModel->where('user_id', $pabrikId);

        // Tambahkan filter pencarian produk jika ada
        if (!empty($search)) {
            $productQuery->groupStart()
                ->like('product_name', $search)
                ->orLike('description', $search)
                ->groupEnd();
        }

        // Dapatkan data produk dengan pagination
        $allProducts = $productQuery->paginate($perPage, 'default', $this->request->getVar('page'));
        $pager = $this->productModel->pager;

        // Ambil semua distributor (ini tidak dipaginasi karena dibutuhkan untuk dropdown filter dan modal detail)
        $distributors = $this->userModel->where('role', 'distributor')->findAll();
---
SELECT *
FROM `products`
WHERE `user_id` = '1'
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `user_id` = '1'
SELECT *
FROM `users`
WHERE `role` = 'distributor'

            // Jika tidak ada filter distributor, ambil semua harga kustom dari SEMUA distributor
            // Ini mungkin akan mengambil banyak data jika ada banyak distributor dan produk.
            // Namun, ini diperlukan untuk menampilkan "Harga Jual Distributor (Rata-rata/Rentang)"
            // dan untuk modal "Lihat Detail" yang menampilkan semua distributor.
            $distributorPrices = $this->userProductModel->findAll();
---
SELECT *
FROM `user_products`