app/Controllers/ProdukController.php

    public function index()
    {
        // Pastikan hanya user dengan role 'pabrik' yang bisa mengakses
        if (session()->get('role') !== 'pabrik') {
            return redirect()->to(base_url('/error'))->with('error', 'Anda tidak memiliki akses ke halaman tersebut.');
        }

        $userId = session()->get('id'); // ID user pabrik yang sedang login
        $search = $this->request->getVar('search'); // Ambil parameter pencarian dari URL
        $perPage = 8; // Jumlah item per halaman, Anda bisa menyesuaikannya

        // Query dasar untuk produk milik pabrik yang login
        $query = $this->productModel->where('user_id', $userId);

        // Tambahkan filter pencarian jika ada
        if (!empty($search)) {
            $query->groupStart()
                ->like('product_name', $search)
                ->orLike('description', $search)
                ->groupEnd();
        }

        // Dapatkan data dengan pagination
        $products = $query->paginate($perPage, 'default', $this->request->getVar('page'));
---
SELECT *
FROM `products`
WHERE `user_id` = '1'
 LIMIT 8
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `user_id` = '1'