app/Models/UserModel.php

SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'distributor'
---
    public function countUsersByRole(string $role)
    {
        return $this->where('role', $role)->countAllResults();